[
  {
    "Question": "Buildfile does not execute in AWS ElasticBeanstalk deployment",
    "Description": "I created a NodeJS-application and would like to deploy it on ElasticBeanstalk with CodePipeline. My first attempt was to put all files in the root (e.g. package.json, Procfile, server.js). This ...",
    "Views": "2 views"
  },
  {
    "Question": "node js and sql server",
    "Description": "I just start learning node js with sql server.\nI'm wondering if there is a way to call this only one time in the beginning when we run the app, instead of calling it in each method in the controller.\n ...",
    "Views": "5 views"
  },
  {
    "Question": "This call draw no fragments Opengles3",
    "Description": "I've a large scale project, so its impossible to provide a fully code here.\nBut I'm having the following scenario.\nI have a triangle that renders perfectly. But when I add another one mesh using ...",
    "Views": "3 views"
  },
  {
    "Question": "save dynamic map with shared preferences",
    "Description": "I want to pass data in my class and save them on the map with shared preferences.\nand read my data in another class.\nmy problem is about saving the map and passing data more than once.\nso how can I ...",
    "Views": "5 views"
  },
  {
    "Question": "Convert Docx to PDF in python folder access permission",
    "Description": "I wrote some python code to convert Docx files to PDF using the docs2pdf package, and have the following code:\nFor f in files:\n    convert(‘input‘ + f + ‘.docx’, ‘ output‘ + f + ‘.pdf’)\n\nIt works, and ...",
    "Views": "5 views"
  },
  {
    "Question": "On react-native-video, how can I manually adjust the video quality across all platforms?",
    "Description": "I'm creating a react-native app that uses react-native-video to stream video. I want users to be able to manually modify the video quality. I haven't been able to figure out how to accomplish it up ...",
    "Views": "4 views"
  },
  {
    "Question": "ThemeOverlay is not styling statusBar in one fragment",
    "Description": "I want to change status bar color for dark blue for only one screen. I'm using ThemeOverlay for this and in fragment XML I set the theme. Why it doesn't work like that?\nthemes.xml:\nresources xmlns:...",
    "Views": "2 views"
  },
  {
    "Question": "How to destruct class with mutex member?",
    "Description": "I have a class with a std::shared_mutex member protecting some resource the class owns (say, a vector). My problem is that during destruction of the class, a different thread may be holding the mutex. ...",
    "Views": "5 views"
  },
  {
    "Question": "GridView is not taking full space inside ExpandableListView in android",
    "Description": "I have to create an ExpandableListView as shown in picture below\n\nI have added GridView inside ExpandableListView but it shows only first line of GridView as you can see in the pic below\n\nGridView is ...",
    "Views": "2 views"
  },
  {
    "Question": "Jest unit test for React component to render array of data",
    "Description": "I'm playing around with react unit cases using famous testing libraries like Jest and react-testing-library, being new to it.\nI have a dropdown component that receives some array of data to render the ...",
    "Views": "3 views"
  },
  {
    "Question": "What is the best way to create AWS elastic beanstalk component?",
    "Description": "Elastic Beanstalk internally uses CloudFormation to provision infrastructure.\nTo create Elastic Beanstalk's components i.e. Application, Environment, Application Version, and information like which ...",
    "Views": "3 views"
  },
  {
    "Question": "How to access base class method *args from child class object in Python?",
    "Description": "I am trying to get base class method *args from child class object. Here is the code:\nclass BaseView():\n\ndef __init__(self, *args, **kwargs):\n    for key, value in kwargs.items():\n        setattr(self,...",
    "Views": "5 views"
  },
  {
    "Question": "pyspark - AttributeError: 'PipelinedRDD' object has no attribute 'select'",
    "Description": "I have been asked to perform this task Click Image\nThis is my code:\nfrom pyspark.sql import SparkSession\nfrom pyspark.sql.functions import rand, randn \nfrom pyspark.sql import SQLContext\n\nspark = ...",
    "Views": "3 views"
  },
  {
    "Question": "How to validate jotfrom in mail my projects?",
    "Description": "I want to validate the jot form to email. How I can do it\nimport React from 'react';\nimport \"./Subscription.css\"\nconst Subscription = () => {\nreturn (\n\n        <section className=\"...",
    "Views": "3 views"
  },
  {
    "Question": "how to change color of highcharter candlestick stockchart?",
    "Description": "I am trying to build a candlestick chart with quantmod and highcharter package. Building the chart is super easy.\nlibrary(quantmod)\nlibrary(highcharter)\n\nx <- getSymbols(\"GOOG\", auto....",
    "Views": "5 views"
  },
  {
    "Question": "Flutter how to play and stop audio at specific time?",
    "Description": "I have an audio player app using just_audio plugin. How to play and stop audio at a specific time?\nFor example, I have an audio file that is 20 minutes long. I want when I press play button, the audio ...",
    "Views": "4 views"
  },
  {
    "Question": "I've got a project to make a compiler from Python to LLVM, is it possible ? Any tips?",
    "Description": "Like the question says, Do you have any tips on how to do it, I was planing to use ANTLR for it",
    "Views": "9 views"
  },
  {
    "Question": "Scrap Data after button click in PuppeeterSharp C#",
    "Description": "I am unable to scrap data after clicking the button in PuppeeterSharp C#.\nHere is my Puppeeter C# code.\nstring url = $\"https://www.google.com\";\nvar response = await page.GoToAsync(url, new ...",
    "Views": "4 views"
  },
  {
    "Question": "exist more methods or <div> is only method [closed]",
    "Description": "Can I use any method for web styling in CSS for  is the only one?enter image description here",
    "Views": "7 views"
  },
  {
    "Question": "Custom Annotation Scope",
    "Description": "Annotaion:\n@Retention(RetentionPolicy.RUNTIME)\n@Target(value = {ElementType.TYPE, ElementType.METHOD})\npublic @interface HasRole {\n    String[] value();\n}\n\nAspect:\n\n@Aspect\n@Component\npublic class ...",
    "Views": "2 views"
  },
  {
    "Question": "Having error Uncaught RangeError: Maximum call stack size exceeded, when trying to close popover in IONIC+VUE(with vuex)",
    "Description": "Good morning developers. I´m working in this IONIC + VUE app , specifically in some popover  with some functionality, but for some reason the popover is having a weird behaviour, cause once is open ...",
    "Views": "4 views"
  },
  {
    "Question": "Object property check and format date",
    "Description": "Need to format the date using header object property type check.\nI have headers object is:\nlet headers = [\n  {\n    key_name: 'trans_id',\n    header_value: 'Transaction ID' ,type:'number' \n  },\n  {\n    ...",
    "Views": "7 views"
  },
  {
    "Question": "Branch io : Setting live and test keys programmatically other than manifest declaration",
    "Description": "Is it possible to set branch live and test keys programmatically?\nCurrently we can only set via Manifest\n<meta-data\n            android:name=\"io.branch.sdk.BranchKey\"\n            android:...",
    "Views": "3 views"
  },
  {
    "Question": "Python's regex Get folder name between name=' and /'",
    "Description": "I want to extract all the folder names between \"name='\"   and \"/'\" under a list of strings using regex\nstring = \"FileInfo(path='dbfs:/mnt/34334324/folder1/', name='folder1/', ...",
    "Views": "10 views"
  },
  {
    "Question": "Is it possible to find equivalent X/Y coordinates in order to print some text at the same position using both ^FO as well as ^FT command using ZPL 2",
    "Description": "I am trying to find out if there is a possible way via which we can convert the X/Y coordinates from the ^FO command to the equivalent ^FT coordinates in such a way that the position of text in the ...",
    "Views": "3 views"
  },
  {
    "Question": "find input tag inside a html div and that div is stored in a javascript variable",
    "Description": "I am creating fully flexible contact us form where user can drag and drop input elements.\nso in that case I am stuck in a problem\nthe html structure is:\n<div class=\"ns_field_box\">\n    &...",
    "Views": "9 views"
  },
  {
    "Question": "How to dynamically use toLabel function with SOQL query to SalesForce API within ADF?",
    "Description": "My objective is to stage data from SalesForce to Azure SQL Database using ADF. In the past we used queries written in SOQL to load the data. However, when the SalesForce consultants introduce new ...",
    "Views": "3 views"
  },
  {
    "Question": "I don't understand the behavior of a pointer",
    "Description": "I'm in a formation and we're seeing pointers. We're facing a mystery :\n#include <stdio.h>\n#include <stdlib.h>\n\nint main()\n{\n    short* p_var= 0;\n    \n    if(p_var == NULL)\n    {\n        ...",
    "Views": "10 views"
  },
  {
    "Question": "How to count by log part in Kibana",
    "Description": "Problem is simple, but I cannot figure out the solution:\nI have logs, in the following pattern:\nSome random text | Some random text | Some text: Data1 | Some random text\nSome random text | Some random ...",
    "Views": "3 views"
  },
  {
    "Question": "How To Read and Print Data from CSV file into HTML File as Text",
    "Description": "I've been trying to read data from .csv file and print the data as text/number into HTML file. Like the below example:\nData from CSV file looks like this\nNow, I want to print in HTML like this:\n...",
    "Views": "8 views"
  },
  {
    "Question": "Bitmap image array from recyclerview to other activity with position",
    "Description": "i want to get single image from bitmap array recyclerview and show it to my detailactivity\n[recyclerview adapterclass][detailactivity]",
    "Views": "5 views"
  },
  {
    "Question": "Does torch.nn.MultiheadAttention contain normalisation layer and feed forward layer?",
    "Description": "Tried to find the source code of multihead attention but could not find any implementation details. I wonder if this module only contains the attention part rather than the whole transformer block (i....",
    "Views": "3 views"
  },
  {
    "Question": "How can I encrypt my dotenv variables when running `npm run build`",
    "Description": "I am building a firebase application using React v17.0.2 that uses dotenv v8.2.0 to populate the firebaseConfig object.\nWhen I run npm run build it bundles the scripts and puts it in the build folder (...",
    "Views": "8 views"
  },
  {
    "Question": "How do I group blocks of data in Python [duplicate]",
    "Description": "Here is an example of the data I am dealing with:\n\nSo my goal is to get the average of a given column, for each and every 'Run', however right now, when I get average of a column it gets the average ...",
    "Views": "5 views"
  },
  {
    "Question": "What mappings is Automapper applying?",
    "Description": "I have a problem where a mapping works when applied as the child of one object but not another and I am clueless how to debug this.\nI map a complex object such as:\nParentType1\n-> ChildType1\n-> ...",
    "Views": "5 views"
  },
  {
    "Question": "Google API create new User",
    "Description": "I'm using Zapier and try to create a new User in Google.\nThe documentation is pretty unclear.\nThis is the request I'm making:\n\nNow I understand, that I need to add authorization to the request.\n\nHow ...",
    "Views": "4 views"
  },
  {
    "Question": "How to disable bottle by default?",
    "Description": "I used to have something like the below in a formula to disable bottle\nbottle :disable, \"Reason to ignore bottle\" \nThis bottle :disable option was removed recently.\nLogs from Homebrew 3.3.9 ...",
    "Views": "3 views"
  },
  {
    "Question": "Remove html tags title from notification banner",
    "Description": "I received a notification alert from server as html format. So how can I display that notification message format by html using custom user notification.",
    "Views": "3 views"
  },
  {
    "Question": "Error in eval(predvars, data, env) : object 'Type' not found",
    "Description": "so i was asked to do a discriminant analysis of the dataset of titanic passenger, so far what i'e done to the dataset is removing unneeded collumn with\ntitanic1=select(titanic,-name, -sex, -ticket, -...",
    "Views": "5 views"
  },
  {
    "Question": "Session expired Issue in spring session and redis",
    "Description": "2022-01-04 22:55:55.187 WARN org.springframework.data.redis.listener.RedisMessageListenerContainer.invokeErrorHandler(291) - Execution of message listener failed, and no ErrorHandler has been set.\norg....",
    "Views": "4 views"
  },
  {
    "Question": "Room field / getter mismatch warning when using sealed classes or Any",
    "Description": "I have a Room (v2.4.0-beta01) database, and whilst it works fine, during the build it gives a field vs getter mismatch warning on a few fields, included below.\nI suspect this is due to an interop ...",
    "Views": "4 views"
  },
  {
    "Question": "TypeError: Cannot read properties of undefined (reading 'fontFamilyUrl') at Object.updateDependenciesToLoad",
    "Description": "I am debugging a code that was developed by someone else. The site was working well, however, after updating the PHP version to 7.4, some pages have failed to load, and the console error that I am ...",
    "Views": "8 views"
  },
  {
    "Question": "Alternatives to \"Windows.ServerBackup\" when there is no Server via Powershell",
    "Description": "I am currently looking into sending \"Backup-Log\" E-Mails like this one (https://jocha.se/blog/tech/wbadmin-backup-mail-report) I found via Powershell. The problem is that it is completely ...",
    "Views": "3 views"
  },
  {
    "Question": "Removing a slice of keys within a Map with time complexity better than O(n^2) in Go",
    "Description": "Basic approach to delete multiple keys from an array of Maps in Go, would be by using nested loops, that is with a parent loop for iterating over array of Maps and an inner loop of slice of Keys to be ...",
    "Views": "6 views"
  },
  {
    "Question": "java inverted pyramid of numbers?",
    "Description": "I was asked to create a java program that will display an inverted pyramid of numbers (1 to 9 only). with user input of how many number of rows.\nI don't know how to loop and limit the numbers to 9 and ...",
    "Views": "14 views"
  },
  {
    "Question": "unless browser.window condition",
    "Description": "I have my Icons defined and want to make them fill another color when the browser size is for example < 960. But I am getting an can not render error.\nmy current approach :\n <svg xmlns=\"...",
    "Views": "16 views"
  },
  {
    "Question": "Wear OS: What is the most suitable Android Wear device for Near-Infrared Spectroscopy (NIRS)?",
    "Description": "I’m looking for a Wear OS device that can access multiple wavelengths of raw PPG data. (At least, it’s neither Fossil Gen 6 nor Gen 5)\nRecently, I am trying to make a Visible-NIR spectroscopy app for ...",
    "Views": "6 views"
  },
  {
    "Question": "Get logged in UserId in Blazor 6 Wasm controller",
    "Description": "I have a Blazor Wasm app under .Net 6 (upgraded from .Net Core). I added default Identity from the Blazor Train video with Chris Sainty which now appears to work. I didn't want to use the Blazor 6 ...",
    "Views": "4 views"
  },
  {
    "Question": "How to import Spacy to run with GCP Dataflow?",
    "Description": "I would like to run Spacy Lemmatization on a column within a ParDo on GCP DataFlow.\nMy DataFlow project is composed by 3 files: main.py which is the file containing the script, myfile.json which ...",
    "Views": "5 views"
  },
  {
    "Question": "SQLSTATE[42S02]: Base table or view not found: 1146 Table 'mkstudent.classes_student' doesn't exist (SQL: insert into `classes_student` (`classes_id`,",
    "Description": "i dont know why it is going to store in mkstudent.classes_student table , i mean i created many to many table class_student and when i tray to store a a student that have a class this error is ...",
    "Views": "8 views"
  }
]